CSI API ETABS v1
cAnalyze.SetSolverOption_1 Method
 DEPRECATED. Please see SetSolverOption_2(Int32, Int32, Int32, String) or SetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSolverOption_1(
	int SolverType,
	int SolverProcessType,
	bool Force32BitSolver,
	string StiffCase = ""
)
Function SetSolverOption_1 (
	SolverType As Integer,
	SolverProcessType As Integer,
	Force32BitSolver As Boolean,
	Optional StiffCase As String = ""
) As Integer
Dim instance As cAnalyze
Dim SolverType As Integer
Dim SolverProcessType As Integer
Dim Force32BitSolver As Boolean
Dim StiffCase As String
Dim returnValue As Integer
returnValue = instance.SetSolverOption_1(SolverType,
	SolverProcessType, Force32BitSolver,
	StiffCase)
int SetSolverOption_1(
	int SolverType,
	int SolverProcessType,
	bool Force32BitSolver,
	String^ StiffCase = L""
)
abstract SetSolverOption_1 :
        SolverType : int *
        SolverProcessType : int *
        Force32BitSolver : bool *
        ?StiffCase : string
(* Defaults:
        let _StiffCase = defaultArg StiffCase ""
*)
-> int
Parameters
SolverType
Type: System.Int32
SolverProcessType
Type: System.Int32
Force32BitSolver
Type: System.Boolean
StiffCase (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace